espruino/Espruino/targetlibs/nrf5x/nrf5_sdk/components/drivers_nrf/pstorage/pstorage.c
#ifdef PSTORAGE_RAW_MODE_ENABLE

/**@brief Verifies the module identifier supplied by the application.
 */
#define MODULE_RAW_HANDLE_CHECK(ID)                                                               \
        if ((((ID)->module_id) != RAW_MODE_APP_ID))                                               \
        {                                                                                         \
            return NRF_ERROR_INVALID_PARAM;                                                       \
        }

#endif // PSTORAGE_RAW_MODE_ENABLE

/**@} */


/**@brief Verify module's initialization status.
 *
 * @details  Verify module's initialization status. Returns NRF_ERROR_INVALID_STATE when a
 *           module API is called without initializing the module.
 */
#define VERIFY_MODULE_INITIALIZED()                                                               \
        do                                                                                        \
        {                                                                                         \
            if (!(m_flags & MASK_MODULE_INITIALIZED))                                             \
            {                                                                                     \
                 return NRF_ERROR_INVALID_STATE;                                                  \
            }                                                                                     \
        } while(0)

/**@brief Macro to fetch the block size registered for the module. */
#define MODULE_BLOCK_SIZE(ID) (m_app_table[(ID)->module_id].block_size)

/**@brief Main state machine of the component. */
typedef enum
{
    STATE_IDLE,                                                        /**< State for being idle (no command execution in progress). */
    STATE_STORE,                                                       /**< State for storing data when using store/update API. */
    STATE_DATA_ERASE_WITH_SWAP,                                        /**< State for erasing the data page when using update/clear API when use of swap page is required. */
    STATE_DATA_ERASE,                                                  /**< State for erasing the data page when using update/clear API without the need to use the swap page. */
    STATE_ERROR                                                        /**< State entered when command processing is terminated abnormally. */
} pstorage_state_t;  

/**@brief Sub state machine contained by @ref STATE_DATA_ERASE_WITH_SWAP super state machine. */
typedef enum
{
    STATE_ERASE_SWAP,                                                  /**< State for erasing the swap page when using the update/clear API. */   
    STATE_WRITE_DATA_TO_SWAP,                                          /**< State for writing the data page into the swap page when using update/clear API. */
    STATE_ERASE_DATA_PAGE,                                             /**< State for erasing data page when using update/clear API. */
    STATE_RESTORE_TAIL,                                                /**< State for restoring tail (end) of backed up data from swap to data page when using update/clear API. */
    STATE_RESTORE_HEAD,                                                /**< State for restoring head (beginning) of backed up data from swap to data page when using update/clear API. */
    SWAP_SUB_STATE_MAX                                                 /**< Enumeration upper bound. */   
} flash_swap_sub_state_t;

/**@brief Application registration information.
 *
 * @details Defines application specific information that the application needs to maintain to be able 
 *          to process requests from each one of them.
 */
typedef struct
{
    pstorage_ntf_cb_t cb;                                              /**< Callback registered with the module to be notified of result of flash access.  */
    pstorage_block_t  base_id;                                         /**< Base block ID assigned to the module. */
    pstorage_size_t   block_size;                                      /**< Size of block for the module. */
    pstorage_size_t   block_count;                                     /**< Number of blocks requested by the application. */
} pstorage_module_table_t;


#ifdef PSTORAGE_RAW_MODE_ENABLE
/**@brief Application registration information.
 *
 * @details Defines application specific information that the application registered for raw mode.
 */
typedef struct
{
    pstorage_ntf_cb_t cb;                                              /**< Callback registered with the module to be notified of the result of flash access.  */
} pstorage_raw_module_table_t;
#endif // PSTORAGE_RAW_MODE_ENABLE


/**@brief Defines command queue element.
 *
 * @details Defines command queue element. Each element encapsulates needed information to process
 *          a flash access command.
 */
typedef struct
{
    uint8_t           op_code;                                         /**< Identifies the flash access operation being queued. Element is free if op-code is INVALID_OPCODE. */
    pstorage_size_t   size;                                            /**< Identifies the size in bytes requested for the operation. */
    pstorage_size_t   offset;                                          /**< Offset requested by the application for the access operation. */
    pstorage_handle_t storage_addr;                                    /**< Address/Identifier for persistent memory. */
    uint8_t *         p_data_addr;                                     /**< Address/Identifier for data memory. This is assumed to be resident memory. */
} cmd_queue_element_t;


/**@brief   Defines command queue, an element is free if the op_code field is not invalid.
 *
 * @details Defines commands enqueued for flash access. At any point in time, this queue has one or
 *          more flash access operations pending if the count field is not zero. When the queue is
 *          not empty, the rp (read pointer) field points to the flash access command in progress 
 *          or, if none is in progress, the command to be requested next. The queue implements a 
 *          simple first in first out algorithm. Data addresses are assumed to be resident.
 */
typedef struct
{
    uint8_t             rp;                                            /**< Read pointer, pointing to flash access that is ongoing or to be requested next. */
    uint8_t             count;                                         /**< Number of elements in the queue.  */
    cmd_queue_element_t cmd[PSTORAGE_CMD_QUEUE_SIZE];                  /**< Array to maintain flash access operation details. */
} cmd_queue_t;

static cmd_queue_t             m_cmd_queue;                            /**< Flash operation request queue. */
static pstorage_size_t         m_next_app_instance;                    /**< Points to the application module instance that can be allocated next. */
static uint32_t                m_next_page_addr;                       /**< Points to the flash address that can be allocated to a module next. This is needed as blocks of a module that can span across flash pages. */
static pstorage_state_t        m_state;                                /**< Main state tracking variable. */
static flash_swap_sub_state_t  m_swap_sub_state;                       /**< Flash swap erase when swap used state tracking variable. */
static uint32_t                m_head_word_size;                       /**< Head restore area size in words. */
static uint32_t                m_tail_word_size;                       /**< Tail restore area size in words. */
static uint32_t                m_current_page_id;                      /**< Variable for tracking the flash page being processed. */
static uint32_t                m_num_of_command_retries;               /**< Variable for tracking flash operation retries upon flash operation failures. */
static pstorage_module_table_t m_app_table[PSTORAGE_NUM_OF_PAGES];     /**< Registered application information table. */
static uint32_t                m_num_of_bytes_written;                 /**< Variable for tracking the number of bytes written by the store operation. */
static uint32_t                m_app_data_size;                        /**< Variable for storing the application command size parameter internally. */
static uint32_t                m_flags = 0;                            /**< Storage for boolean flags for state tracking. */

