espruino/Espruino/targetlibs/nrf5x/nrf5_sdk/components/drivers_nrf/pstorage/pstorage.c
#ifdef PSTORAGE_RAW_MODE_ENABLE
static pstorage_raw_module_table_t m_raw_app_table;                    /**< Registered application information table for raw mode. */
#endif // PSTORAGE_RAW_MODE_ENABLE

// Required forward declarations.
static void cmd_process(void);
static void store_operation_execute(void);
static void app_notify(uint32_t result, cmd_queue_element_t * p_elem);
static void cmd_queue_element_init(uint32_t index);
static void cmd_queue_dequeue(void);
static void sm_state_change(pstorage_state_t new_state);
static void swap_sub_state_state_change(flash_swap_sub_state_t new_state); 

/**@brief Function for consuming a command queue element.
 *
 * @details Function for consuming a command queue element, which has been fully processed.
 */
static void command_queue_element_consume(void)
{
    // Initialize/free the element as it is now processed.    
    cmd_queue_element_init(m_cmd_queue.rp);

    // Adjust command queue state tracking variables.
    --(m_cmd_queue.count);   
    if (++(m_cmd_queue.rp) == PSTORAGE_CMD_QUEUE_SIZE)
    {
        m_cmd_queue.rp = 0;
    }    
}


/**@brief Function for executing the finalization procedure for the command executed.
 *
 * @details Function for executing the finalization procedure for command executed, which includes 
 *          notifying the application of command completion, consuming the command queue element, 
 *          and changing the internal state.
 */
static void command_end_procedure_run(void)
{    
    app_notify(NRF_SUCCESS, &m_cmd_queue.cmd[m_cmd_queue.rp]);
    
    command_queue_element_consume();
    
    sm_state_change(STATE_IDLE);
}


/**@brief Function for idle state entry actions.
 *
 * @details Function for idle state entry actions, which include resetting relevant state data and 
 *          scheduling any possible queued flash access operation.
 */
static void state_idle_entry_run(void)
{
    m_num_of_command_retries = 0;
    m_num_of_bytes_written   = 0;
    
    // Schedule any possible queued flash access operation.
    cmd_queue_dequeue();
}


/**@brief Function for notifying an application of command completion and transitioning to an error 
 *        state.
 *
 * @param[in] result Result code of the operation for the application.
 */
static void app_notify_error_state_transit(uint32_t result)
{
    app_notify(result, &m_cmd_queue.cmd[m_cmd_queue.rp]);
    sm_state_change(STATE_ERROR);                
}


/**@brief Function for processing flash API error code.
 *
 * @param[in] err_code Error code from the flash API.
 */
static void flash_api_err_code_process(uint32_t err_code)
{
    switch (err_code)
    {
        case NRF_SUCCESS:
            break;
            
        case NRF_ERROR_BUSY:
            // Flash access operation was not accepted and must be reissued upon flash operation 
            // complete event.
            m_flags |= MASK_FLASH_API_ERR_BUSY;        
            break;
            
        default:
            // Complete the operation with appropriate result code and transit to an error state. 
            app_notify_error_state_transit(err_code);
            break;
    }
}

/**@brief Function for writing data to flash.
 *
 * @param[in] p_dst         Pointer to start of flash location to be written.
 * @param[in] p_src         Pointer to buffer with data to be written.
 * @param[in] size_in_words Number of 32-bit words to write. 
 */
static void flash_write(uint32_t * const       p_dst, 
                        uint32_t const * const p_src, 
                        uint32_t               size_in_words)
{
    flash_api_err_code_process(sd_flash_write(p_dst, p_src, size_in_words));    
}


/**@brief Function for writing data to flash upon store command.
 *
 * @details Function for writing data to flash upon executing store command. Data is written to 
 *          flash in reverse order, meaning starting at the end. If the data that is to be written 
 *          is greater than the flash page size, it will be fragmented to fit the flash page size.
 */
static void store_cmd_flash_write_execute(void)
{
    const cmd_queue_element_t * p_cmd = &m_cmd_queue.cmd[m_cmd_queue.rp];
    
    if (p_cmd->size > SOC_MAX_WRITE_SIZE)    
    {
        const uint32_t offset = p_cmd->size - PSTORAGE_FLASH_PAGE_SIZE;
        flash_write((uint32_t *)(p_cmd->storage_addr.block_id + p_cmd->offset + offset),
                    (uint32_t *)(p_cmd->p_data_addr + offset), 
                    PSTORAGE_FLASH_PAGE_SIZE / sizeof(uint32_t));   

        m_num_of_bytes_written = PSTORAGE_FLASH_PAGE_SIZE;    
    }
    else
    {
        flash_write((uint32_t *)(p_cmd->storage_addr.block_id + p_cmd->offset),
                    (uint32_t *)(p_cmd->p_data_addr), 
                    p_cmd->size / sizeof(uint32_t));   

        m_num_of_bytes_written = p_cmd->size;        
    }    
}


/**@brief Function for store state entry action.
 *
 * @details Function for store state entry action, which includes writing data to a flash page.
 */
static void state_store_entry_run(void)
{
    store_cmd_flash_write_execute();    
}


/**@brief Function for data erase with swap state entry actions.
 *
 * @details Function for data erase with swap state entry actions. This includes adjusting relevant 
 *          state and data variables and transitioning to the correct sub state.
 */
static void state_data_erase_swap_entry_run(void)
{
    m_flags &= ~MASK_TAIL_SWAP_DONE;
    
    const cmd_queue_element_t * p_cmd        = &m_cmd_queue.cmd[m_cmd_queue.rp];
    const pstorage_block_t      cmd_block_id = p_cmd->storage_addr.block_id;
    
    const uint32_t clear_start_page_id = cmd_block_id / PSTORAGE_FLASH_PAGE_SIZE;
    m_current_page_id                  = clear_start_page_id;      
        
    // @note: No need to include p_cmd->offset when calculating clear_end_page_id as:
    // - clear API does not include offset parameter
    // - update and store APIs are limited to operate on single block boundary thus the boolean 
    // clause ((m_head_word_size == 0) && is_more_than_one_page) below in this function  will never 
    // evaluate as true as if is_more_than_one_page == true m_head_word_size is always != 0        
    const uint32_t clear_end_page_id  = (cmd_block_id + p_cmd->size - 1u) / 
                                        PSTORAGE_FLASH_PAGE_SIZE;

    if (clear_start_page_id == clear_end_page_id)
    {
        m_flags |= MASK_SINGLE_PAGE_OPERATION;
    }
    else
    {
        m_flags &= ~MASK_SINGLE_PAGE_OPERATION;
    }
                            
    if ((m_head_word_size == 0) && !(m_flags & MASK_SINGLE_PAGE_OPERATION))
    {        
        // No head restore required and clear/update area is shared by multiple flash pages, which 
        // means the current flash page does not have any tail area to restore. You can proceed with 
        // data page erase directly as no swap is needed for the current flash page.
        swap_sub_state_state_change(STATE_ERASE_DATA_PAGE);        
    }
    else
    {     
        swap_sub_state_state_change(STATE_ERASE_SWAP);
    }               
}


/**@brief Function for erasing flash page.
 *
 * @param[in] page_number Page number of the page to be erased.
 */
static void flash_page_erase(uint32_t page_number)
{
    flash_api_err_code_process(sd_flash_page_erase(page_number));
}


/**@brief Function for data erase state entry action.
 *
 * @details Function for data erase state entry action, which includes erasing the data flash page.
 */
static void state_data_erase_entry_run(void)
{
    flash_page_erase(m_current_page_id);                          
}


/**@brief Function for dispatching the correct application main state entry action.
 */
static void state_entry_action_run(void)
{
    switch (m_state)
    {
        case STATE_IDLE:
            state_idle_entry_run();
            break;

        case STATE_STORE:
            state_store_entry_run();
            break;
            
        case STATE_DATA_ERASE_WITH_SWAP:
            state_data_erase_swap_entry_run();
            break;
            
