espruino/Espruino/targetlibs/nrf5x/nrf5_sdk/components/drivers_nrf/pstorage/pstorage.c
/**@brief Function for doing data page erase state action upon a flash operation success event.
 *
 * @details Function for doing data page erase state action upon a flash operation success event, 
 *          which includes making a state transit to a new state depending on the current state.
 */
static void data_page_erase_state_run(void)
{            
    if (!(m_flags & MASK_FLASH_API_ERR_BUSY))
    {
        ++m_current_page_id;   
                    
        if (m_head_word_size != 0)
        {            
            swap_sub_state_state_change(STATE_RESTORE_HEAD);
        }
        else if (is_page_erase_required())
        {
            // Additional page erase operation is required.    
            swap_sub_state_state_change(STATE_ERASE_DATA_PAGE);                
        }                
        else if (m_tail_word_size != 0)
        {                    
            if (!(m_flags & MASK_TAIL_SWAP_DONE)) 
            {
                // Tail area restore is required and we have not yet written the relevant data page 
                // to swap area. Start the process of writing the data page to swap.
                m_flags |= MASK_TAIL_SWAP_DONE;            

                swap_sub_state_state_change(STATE_ERASE_SWAP);            
            }
            else
            {
                // Tail area restore is required and we have already written the relevant data page 
                // to swap area. Proceed by restoring the tail area.
                swap_sub_state_state_change(STATE_RESTORE_TAIL);            
            }
        }            
        else
        {
            swap_sub_sm_exit_action_run();        
        }        
    }
    else
    {
        // As operation request was rejected by the flash API reissue the request.
        swap_sub_state_err_busy_process();        
    }
}


/**@brief Function for doing data to swap write state action upon flash operation success event.
 */
static void data_to_swap_write_state_run(void)
{        
    if (!(m_flags & MASK_FLASH_API_ERR_BUSY))
    {
        // If the operation is executed only on 1 single flash page it automatically means that tail 
        // area is written to the swap, which we store to flags.     
        if (m_flags & MASK_SINGLE_PAGE_OPERATION)
        {
            m_flags |= MASK_TAIL_SWAP_DONE;        
        }

        swap_sub_state_state_change(STATE_ERASE_DATA_PAGE);    
    }
    else
    {
        // As operation request was rejected by the flash API reissue the request.
        swap_sub_state_err_busy_process();        
    }        
}


/**@brief Function for doing swap erase state action upon flash operation success event.
 */
static void swap_erase_state_run(void)
{
    if (!(m_flags & MASK_FLASH_API_ERR_BUSY))
    {        
        swap_sub_state_state_change(STATE_WRITE_DATA_TO_SWAP);
    }
    else
    {
        // As operation request was rejected by the flash API reissue the request.
        swap_sub_state_err_busy_process();        
    }
}


/**@brief Function for dispatching the correct state action for data erase with a swap composite 
*         state upon a flash operation success event.
 */
static void swap_sub_state_sm_run(void)
{  
    static void (* const swap_sub_state_sm_lut[SWAP_SUB_STATE_MAX])(void) = 
    {
        swap_erase_state_run,
        data_to_swap_write_state_run,
        data_page_erase_state_run,
        tail_restore_state_run,
        head_restore_state_run
    };
    
    swap_sub_state_sm_lut[m_swap_sub_state]();    
}


/**@brief Function for reissuing the last flash operation request, which was rejected by the flash 
 *        API, in main sate.
 */
static void main_state_err_busy_process(void)
{
    // Reissue the request by doing a self transition to the current state.    
    m_flags &= ~MASK_FLASH_API_ERR_BUSY;
    sm_state_change(m_state);                    
}


/**@brief Function for doing erase state action upon flash operation success event.
 *
 * @details Function for doing erase state action upon flash operation success event, which includes 
 *          making a state transition depending on the current state.
 */
static void erase_sub_state_sm_run(void)
{
    if (!(m_flags & MASK_FLASH_API_ERR_BUSY))
    {        
        // Clear operation request has succeeded.
        ++m_current_page_id;                        
                
        if (!is_page_erase_required())
        {
            clear_post_processing_run();
        }
        else
        {   
            // All required flash pages have not yet been erased, issue erase by doing a self 
            // transit. 
            sm_state_change(m_state);        
        }                              
    }
    else
    {
        // As operation request was rejected by the flash API reissue the request.
        main_state_err_busy_process();
    }
}


/**@brief Function for doing store state action upon flash operation success event.
 */
static void store_sub_state_sm_run(void)
{
    if (!(m_flags & MASK_FLASH_API_ERR_BUSY))
    {        
        // As write operation request has succeeded, adjust the size tracking state information 
        // accordingly.
        cmd_queue_element_t * p_cmd = &m_cmd_queue.cmd[m_cmd_queue.rp];    
        p_cmd->size                -= m_num_of_bytes_written;

        if (p_cmd->size == 0)
        {
            command_end_procedure_run();
        }
        else
        {
            store_cmd_flash_write_execute();
        }
    }
    else
    {
        // As operation request was rejected by the flash API reissue the request.
        main_state_err_busy_process();
    }
}


/**@brief Function for doing action upon flash operation success event.
 */
static void flash_operation_success_run(void)
{    
    switch (m_state)
    {                   
        case STATE_STORE:
            store_sub_state_sm_run();
            break;
                        
